/**
Created by mason on 2023/5/1.
 第四章：C语言的常用的表达士的课后练习题目
*/
#include<stdio.h>

/**
 * Exercise 4.01
   Show the output produced by each of the following program fragments. Assume that
   `i`, `j`, and `k` are `int` variables.
 */
void exec_01() {
    int i, j, k;
    i = 5, j = 3;
    printf("%d %d\n", i / j, i % j);
    i = 2, j = 3;
    printf("%d\n", (i + 10) % j);
    i = 7, j = 8, k = 9;
    printf("%d\n", (i + 10) % k / j);
    i = 1, j = 2, k = 3;
    printf("%d\n", (i + 5) % (j + 2) / k);
}

/**
 * Exercise 4.02
    If `i` and `j` are positive integers, does `(-i)/j` always have the same value
    as `-(i/j)`? Justify your answer.

 */
void exec_02() {
    //第一种情况是相等的
    int i = 5, j = 3; //在mac上正负数的结果都一样
    printf("(-i) / j的值:%d\n", (-i) / j);  //(-i)/j = (-5)/3 = -1

    printf("-(i/j)的值:%d\n", -(i / j));   //-(i/j) = -(5/3) = -(1) = -1
    //第二种情况
    i = 3, j = 2; //在mac上正负数的结果都一样
    printf("(-i) / j的值:%d\n", (-i) / j);  //(-i)/j = (-2)/3 = 0

    printf("-(i/j)的值:%d\n", -(i / j));   //-(i/j) = -(2/3) = -(0) = 0
    //以上两种情况在macOS系统都是相等的
    /*当除法运算符／和模运算符％用于负操作数时，其结果和 C 语言标准相关。在C89中，如果两个操作数中有一个为负数，
     * 那么除法的结果既可以向上取整也可以向下取整，模运算的结果也是由实现定义的。在C99中，除法的结果总是向0截取，
     * 模运算结果的正负符号与模运算符％左侧操作数的符号相同。 C 语言中的由实现定义是指，最终结果依赖程序在特定平台上编译、
     * 链接和执行所需要的软件，具体实现条件不同，程序的行为可能会稍有差异。程序设计中应当尽量避免由实现定义的行为，
     * 并考虑编译器所支持的 C 语言标准。参考答案表达式（- i )/ j 和﹣( i / j ）求值，如果在C99标准下，
     * 除法的运算结果总是向0截取，因此结果均相同，例如﹣5/3和﹣(5/3）的结果约为﹣1.7和﹣(+1.7)，
     * 向0截取后最终结果为和﹣(+1)。而C89下除法的运算结果既可以向上取整也可以向下取整，
     * 因此可能会不一致。(- i )的结果可能为﹣1或者﹣2,-( i / j ）的结果可确定为﹣1。
     * */


}

/*
 * Exercise 4.03
    What is the value of each of the following expressions in C89? (Give all
    possible values if an expression may have more than one value.)
    (a) 8 / 5
    (b) -8 / 5
    (c) 8 / -5
    (d) -8 / -5
 */
void exec_03() {
    printf("%d\n", 8 / 5);
    printf("%d\n", -8 / 5);
    printf("%d\n", 8 / -5);
    printf("%d\n", -8 / -5);
    /*输出
   （a) 1
    (b) -1 or -2
    (c) -1 or -2
    (d) 1 or 2
     *( a )8/5的结果为1。该表达式的操作数均为正数，因此并不涉及负数的取整问题，均采用向下取整方式，因此结果为1。
     * ( b )-8/5的结果可能为﹣1或者-2，由定义实现。该表达式中负号运算符的优先级高于除法运算符，因此是负数和正数的除法，
     *  结果为负数，C89标准下是由实现定义的。
     * ( c )8/-5的结果可能是﹣1或者﹣2，表达式的具体运算过程和（ b ）类似。
     * ( d )-8/-5的结果是1。该表达式中两个负号运算符的优先级高于除法运算符，因此结果为正数，向下取整结果为1。
     * */

}

/*
 * Exercise 4.04
Repeat Exercise 3 for C99.
 */
void exec_04() {
    /*根据C99标准，除法的结果向0取整，即正数向下取整，负数向上取整；由于不是"由实现定义"的，因此结果是确定的。参考答案( a )8/5的结果为1，向0取整。
     * ( b )-8/5的结果为﹣1，向0取整。
     * ( c )8/-5的结果为﹣1，向0取整。
     * ( d )-8/-5的结果为1，向0取整。*/
    printf("%d\n", 8 / 5);
    printf("%d\n", -8 / 5);
    printf("%d\n", 8 / -5);
    printf("%d\n", -8 / -5);
}

/*
 *  Exercise 4.05
    What is the value of each of the following expressions in C89? (Give all
    possible values if an expression may have more than one value.)
    (a) 8 % 5
    (b) -8 % 5
    (c) 8 % -5
    (d) -8 % -5
 */
void exec_05() {
    printf("8 %% 5 = %d\n", 8 % 5);
    printf("-8 %%5 = %d\n", -8 % 5);
    printf("8 %% -5 = %d\n", 8 % -5);
    printf("-8 %%-5 = %d\n", (-8) % (-5));
    /*在C89标准中，操作数是负数时的除法运算比较容易理解，而操作数是负数时的模运算容易混淆，
     * 对此我们可以通过除法进行转换计算。由于C89和C99都要确保（ a / b )* b + a % b 的结果总是等于 a ，
     * 因此我们可以通过除法运算推算出模运算的结果，这样更加易于理解。
     * 例如，C89标准下﹣9/7的结果可能为﹣1或者﹣2，因此﹣9%7的值可能是﹣2或者5。
     * ( a )8%5的运算结果为3，操作数为整数，结果为余数。
     * ( b ）由于C89下﹣8/5的运算结果为﹣1或者﹣2，因此﹣8%5的运算结果为﹣3或者2。
     * ( c ）由于C89下8/-5的运算结果为﹣1或者﹣2，因此8%-5的运算结果为3或者﹣2。
     * ( d ）由于C89下﹣8/-5的运算结果为1，因此﹣8%-5的运算结果为﹣3。*/
}
/*
 * Exercise 4.06
Repeat Exercise 5 for C99.
 */
void exec_06(){
    printf("8 %% 5 = %d\n", 8 % 5);
    printf("-8 %%5 = %d\n", -8 % 5);
    printf("8 %% -5 = %d\n", 8 % -5);
    printf("-8 %%-5 = %d\n", (-8) % (-5));
/*( a )8%5( b )-8%5( c )8%-5( d )-8%-5习题解析在C99标准中，操作数是负数时的除法运算比较容易理解，均是向0取整。
 * 此时模运算％的运算结果和运算符左侧操作数符号相同，可以沿用（ a / b )* b + a % b 的结果总是等于 a 的定义，推测出模运算的结果。
 * ( a )8%5的运算结果为3，操作数为整数，结果为余数。( b ）由于C99下﹣8/5的运算结果为﹣1，
 * 因此﹣8%5的运算结果为﹣3。( c ）由于C99下8/-5的运算结果为﹣1，因此88-5的运算结果为3。
 * ( d ）由于C99下﹣8/-5的运算结果为1，因此﹣8%-5的运算结果为﹣3。三几步景，把总的结果减去1，相减后的结果除以10取余数，用该月向余法为正*/
}
/**
 * 练习09:给出下列片段的输出结果。假设i、j和k都是int型整数
 */
void exec_09() {
    int i, j, k;
    //a.
    i = 7, j = 8;
    i *= j + 1;
    printf("%d %d\n", i, j);
    //b.
    i = j = k = 1;
    i += j += k; //根据+=是右结合可以判断出:1.先j=j+k,然后i= i+j;
    printf("%d %d %d \n", i, j, k);
    //c.
    i = 1, j = 2, k = 3;
    i -= j -= k;  //同理也是右结合
    printf("%d %d %d\n", i, j, k);
    //d.
    i = 2, j = 1, k = 0;
    i *= j *= k;
    printf("%d %d %d\n", i, j, k);

}

/**
 * 课后练习题目10：给出下列程序片段的输出结果。假设i和j都是int型变量
 */
void exec_10() {
    int i, j;
    //a.
    i = 6;
    j = i += i;
    printf("%d %d\n", i, j);
    //b.
    i = 5;
    j = (i -= 2) + 1;
    printf("%d %d\n", i, j);
    //c.
    i = 7;
    j = 6 + (i = 2.5);
    printf("%d %d\n", i, j); //i=2,j=8,这里是否涉及类型转换？和Java的基本数据类型转换不一致？待后面确定
    //d.
    i = 2, j = 8;
    j = (i = 6) + (j = 3);
    printf("%d %d\n", i, j);//6,9


}

/**
 * 课后练习11.
 */
void exec_11() {
    int i, j, k;
    //a.
    i = 1;
    printf("%d\n", i++ - 1);//0
    printf("%d\n", i);//2
    //b.
    i = 10, j = 5;
    printf("%d\n", i++ - ++j);//4
    printf("%d %d\n", i, j); //11,6
    //c.
    i = 7, j = 8;
    printf("%d\n", i++ - --j);//7-7=0，然后i=i+1=8
    printf("%d %d\n", i, j); //8,7
    //d.
    i = 2, j = 8, k = 5;
    printf("%d\n", i++ - j++ + --k);//2-8-(5-1)=-10
    printf("%d %d %d\n", i, j, k); //3,9,4
}

/**
 * 课后练习12题
 */
void exec_12() {
    int i, j;
    //a.
    i = 5;
    j = ++i * 3 - 2; //i=6,6*3=18,18-2=16
    printf("%d %d\n", i, j);
    //b.
    i = 5;
    j = 3 - 2 * i++; //3 -2*5=-17,i++=6
    printf("%d %d\n", i, j);
    //c.
    i = 7;
    j = 3 * i-- + 2;
    printf("%d %d\n", i, j);

    //d.
    i = 7;
    j = 3 + --i * 2; //3+(7-1)*2=15
    printf("%d %d\n", i, j);

}

/**
 * 课后练习15题；验证表达式++i和表达式i++与(i+=1)哪个是完全形同的？
 */
void exec_13() {
    int i = 1;
    // ++i;    //2
    // i++;       //i++表达式运行后再打印就变成了2
    i += 1;
    printf("i的结果：%d\n", i); //
    //综上可知道：++i和i+=1是完全相同的

}

/**
 * 课后练习14：添加圆括号，说明c语言编译器如何解释下列表达式
 *    ( a) a * b - c * d + e
      (b) a / b % c / d
      (c) - a - b + c - + d
      (d) a * - b / c - d
 */
void exec_14() {
    /**
    (a) (((a * b) - (c * d)) + e)
    (b) (((a / b) % c) / d)
    (c) ((((- a) - b) + c) - (+ d))
    (d) (((a * (- b)) / c) - d)
    */

}

int main() {
    // exec_01();
    //exec_02();
    //exec_03();
    exec_05();
    // exec_09();
    //exec_10();
    // exec_11();
    //exec_12();
    //exec_13();
    return 0;
}








