/**
Created by mason on 2023/5/13.
 第6章：循环语句课后练习题
*/
#include <stdio.h>

/**
 * 课后练习1-2-3
 */
void exec06_1_2_3() {
    int i = 1;
//    while (i <= 128) {
//        printf("%d\n", i);
//        i *= 2;
//    }
//将上面的while循环语句改为for循环语句
    for (i = 1; i <= 128; i *= 2) {
        printf("%d\n", i);

    }
    i = 9384;
    int n = 0;
    do {
        printf("%d\n", i);
        i /= 100;  //第一次除等于:i=938,也就是说第一次除等于去掉个位数上值
        //第二次除等于：i=93,也就是说第一次除等于去掉十位数上值
        //第三次除等于: i=9，也就是说第一次除等于去掉百位数上值
        //第四次除等于: i =0,也就是说第一次除等于去掉千位数上值
        //如果除等于100,第一次i的值是去掉个位和十位上的数字
        n++;

    } while (i > 0);
    printf("循环执行的次数：%d\n", n);

    //将上面的do循环语句改为一条for语句
    for (i = 9384; i > 0; i /= 100) {
        printf("%d\n", i);

    }

//注意下面的写法，C语言的for循环的三个控制表达式都是没有限制的
//    for (int i = 5, j = i - 1; i > 0, j > 0; --i, j = i - 1) {
//        printf("%d\n", i);
//    }
}

/**
 * 课后练习第四题：下列那条语句和其他的两条语句不等价(假设循环体都是一样的)
 */
void exec06_4() {
    int i;

    /*
     * 第三个语句(c)不等同于其他两个语句，因为后缀
递增运算符只会在条件表达式为后应用
求值，不像其他两个表达式是分开的.
*/
    for (i = 0; i < 10; i++)
        printf("i++在第三个表达式的值：%d\n", i);
    for (i = 0; i < 10; ++i)
        printf("++i在第三个表达式的值:%d\n", i);
    for (i = 0; i++ < 10;)
        printf("i++在第二个表达式的值:%d\n", i);

}

/**
 * 课后练习题目：8-9
 * 8:下面这条for语句的输出是什么？
 * 9:把练习8中的for语句改写成一条等价的while语句。除了while循环本身之外，还需要一条语句.
 *
 */

void exec06_8_9() {
    //程序将打印“10 5 3 2”，然后打印一个无穷无尽的“1”流。的
    //print语句中的后缀自增操作符总是会导致
    //条件在' for '循环中返回true
    int i;
//    for (i = 10; i >= 2; i /= 2) {
//        printf("%d", i++);
//
//    }
    //改成一条等价的while语句
    i = 10;
    while (i >= 1) {
        //这个顺序要放到printf函数的下面    i /= 2;
        printf("%d", i++);
        i /= 2;
    }
}

/**
 * 课后练习10:说明如何用等价的goto语句替换continue语句。
 */
void exec06_10() {
    //使用continue语句
    for (int i = 0; i < 10; i++) {
        if (i % 2 == 1)
            continue;
        // break;   //break语句只要有满足条件就会停止循环
        printf("打印出来的i值：%d\n", i);
    }

    //使用goto语句替换掉
    for (int n = 0; n < 10; n++) {
        if (n % 2 == 1)
            goto end;
        printf("打印出来的n：%d\n", n);
        end: //需要加一个表达式不然编译后运行会失败的
        printf("goto 的替换掉continue语句\n");
    }


}

/**
 * 课后练习11:下列程序片段输出的是什么？
 */

void exec06_11() {
    int sum = 0;
    for (int i = 0; i < 10; ++i) {
        if (i % 2) //这里只要取余数值不等0其它都是可以的，因此能被整除的数有：0、2、4、6、8
            continue; //break语句刚好把程序控制转移到循环体末尾之后，而continue语句刚好把程序控制转移
        // * 到循环体末尾之前；break语句会使程序控制跳出循环，而continue语句会把程序控制留在循环内；
        //break;
        //使用break，则输出sum是0,直接跳过sum+=i这个表达式
        //如果i % 2能够被整除才会继续执行到第二个if判断，如果if第一个判断结果为true，则会结束这次循环，继续下一次循环
        if (i / 2)
            break;
        sum += i;

    }
    //使用continue语句最终输出的只有20
    printf("%d\n", sum);

}

/**
 * 课后练习12:下面的“素数判定”循环作为示例出现在6.4节中
 * for (d =2; d < n; d++)
 *     if (n %d ==0)
 *      break;
 *  这个循环不是很高效。没有必要除以2~n-1的所有数来判断它是否为素数。事实上，只需要检查不大于n的平方根的除数即可。
 *  利用这一点来修改循环。提示：不要试图计算出n的平方根，用d*d和n进行比较
 */
void exec06_12() {
    //这里其实可以加上一个布尔值,然后返回的布尔值进行判断，布尔值的true，flag = true,
    int n, d;
    printf("Enter a number: ");
    scanf("%d", &n);
    for (d = 2; d * d <= n; ++d) {
        if (n % d == 0) {
            printf("%d is divisible by %d\n", n, d);
            //flag = false;
            break;
        }

    }
    // printf("%d is prime\n", n);


}

/**
 * 课后练习13-14:
 * 13:重写下面的循环，使其循环体为空
 * for(n = 0; m> 0;n++)
 *    m /=2;
 *14:找出下面程序片段中的错误并修正
 * if(n % 2 ==0);
 *   printf("n is even\n");
 */
void exec06_13_14() {
    int n = 0, m;
    //以下是省略表达
    for (; m > 0;) {
        m /= 2;
        n++;
    }
    //循环体为空
    for (n = 0; m > 0; n++, m /= 2)  //不能把;放在这里后面，要单独放在一行的
        ;
    //if/for语句中，如果圆括号后边放置分号，无论控制表达式的值是什么，if语句执行的动作都是一样的;
    //if (m == 0);
     printf("Error: Division by zero\n");//因为printf语句调用不在if语句内，所以无论d的值是否等于0，都会
    //执行次函数调用

}

//int main() {
    // exec06_1_2_3();
    //exec06_4();
    // exec06_8_9();
    //exec06_10();
    // exec06_11();
    //exec06_12();
    //exec06_13_14();
   // return 0;
//}
