/**
Created by mason on 2023/6/3
 第八章：数组对应的课后练习题
*/
#include <stdio.h>
#include<stdbool.h>

#define DAYS 30
#define HOURS 24

/**
 * 课后练习01：
 * */
void exec08_test01() {
    /*问题:前面讨论过，可以用表达式sizeof(a) / sizeof(a[0])计算数组元素个数。表达式sizeof(a)/sizeof(t)也可以完成同样的工作
 * ，其中t表示数组a中元素的类型，但我们认为这是一种较差的方法。这是为什么呢？*/
    int a[] = {1, 2, 3, 45, 67};
    int len = (int) sizeof(a) / sizeof(a[0]);
    printf("%d\n", len);//5
    int len2 = (int) sizeof(a) / sizeof(int);
    printf("%d\n", len2); //5
    //第一个表达式更加简洁灵活，它不用太关注数组a的具体数据类型，比如数组a数据类型从int改为long
    //它不需要改变，但是第二表达式就需要修改数组a中t表示的数据类型，比较繁琐

}

/**
 * 课后练习02:“问”与“答”部分介绍了字母作为数组下标的方法。请描述以下如何使用(字符格式的)数字作为数组的下标
 *
 * */
void exec08_test02() {
    /*使用字符作为数组的下标是否可行呢？
     * 这是可以的，因为C语言把字符作为整数来处理。但是使用字符作为下标前，可能需要对字符进行“缩放”。举个例子，假设希望数组letter_count对字母
     * 表中的每个字母进行跟踪统计数。这个数组将需要26个元素，所以可以采用下列方式对其进行声明：
     * */
    char c;
    int letter_count[26];
    letter_count[c - '0'] == letter_count[5]; /* true */
    /*然后不能直接使用字母作为数组letter_count的下标，因为字母的整数值不是落在0～25的区间内的。为了把小写字母缩放到合适的范围内，可以
     * 简单采用减去‘a’的方法；为了缩放大写字母，则可以减去‘A’.例如，如果ch含有小写字母，为了对相应的计数进行清零操作，可以这样写：*/
    letter_count[c - 'a'] = 0;
}

/*
 * 课后练习03-04:声明一个数组名为weekend的数组，其中包含7个bool值。要求用一个初始化器把第一个值和最后一个值
 * 置为true,其他值都置为false.
 * */
void exec08_test03() {
    int weekend[7] = {1, 0, 0, 0, 0, 0, 1};

    // int weekend[7] = {[0] = true, [6] = true};
    // int weekend[7] = {[0] = 1, [6] = 1};

}

/**
 * 课后练习05：斐波那契数列为0，1，1，2，3，5，8，13...，其中从第三个数开始，每个数是其前面两个数的和。
 * 编写一个程序片段，声明一个名为fib_number的长度为40的数组，并填入前40个斐波那契数。提示：先填入
 * 前两个数，然后用循环计算其余的数
 *
 * */
void exec08_test05() {
    //  int i, fib_numbers[40] = {[0]=0, [1]=1};
    int i;
    long fib_numbers[40] = {0, 1};
    int len = (int) sizeof(fib_numbers) / sizeof(fib_numbers[0]);
    for (i = 2; i < len; i++)
        fib_numbers[i] = fib_numbers[i - 1] + fib_numbers[i - 2];
    for (i = 0; i < len; ++i)
        printf(" %ld", fib_numbers[i]);
}

/*
 * 课后练习06_07:计算器、电子表和其他电子设备经常依靠七段显示器进行数值的输出。为了组成数字，这类设备需要
 * 打开7个显示段中的某些部分，同时关闭其它部分：
 * 假设需要设置一个数组来记住显示每个数字数字时需要打开的显示段。各显示段的编号如下
 * 下面是数组的可能形式，每一行表示一个数字：
 * const int segments[10][7] = {{1,1,1,1,1,1,0},...};
 * 上面已经给出了初始化器第一行，请填充剩余的部分：
 *
 * */
void exec08_test06_07() {
    const int segments[10][7] = {{1, 1, 1, 1, 1, 1, 0},
                                 {0, 1, 1, 0, 0, 0, 0},
                                 {1, 1, 0, 1, 1, 0, 1},
                                 {1, 1, 1, 1, 0, 0, 1},
                                 {0, 1, 1, 0, 0, 1, 1},
                                 {1, 0, 1, 1, 0, 1, 1},
                                 {1, 0, 1, 1, 1, 1, 1},
                                 {1, 1, 1, 0, 0, 0, 0},
                                 {1, 1, 1, 1, 1, 1, 1},
                                 {1, 1, 1, 1, 0, 1, 1}};
    const int segments_07[10][7] = {{1, 1, 1, 1, 1, 1, 0},
                                    {0, 1, 1, 0, 0, 0, 0},
                                    {1, 1, 0, 1, 1, 0, 1},
                                    {1, 1, 1, 1, 0, 0, 1},
                                    {0, 1, 1, 0, 0, 1, 1},
                                    {1, 0, 1, 1, 0, 1, 1},
                                    {1, 0, 1, 1, 1, 1, 1},
                                    {1, 1, 1, 0, 0, 0, 0},
                                    {1, 1, 1, 1, 1, 1, 1},
                                    {1, 1, 1, 1, 0, 1, 1}};
}

/**
 * 课后练习08:为一个名为temperature_readings的二维数组编写声明。该数组的一个月中每小时的温度读数。(简单起见，假定每个月有30天)。数组的
 * 每一行对应一个月中的每一天，每一列对应一天中的小时数：
 * 课后练习09:利用练习题8中的数组，编写一段程序，计算一个月平均的温度(对每月中的每天和每天中的每小时的温度取平均).
 */
void exec08_08_09() {
    // double temperature_readings[30][24] = {0};
    int i, j;
    double average_temperature = 0.0, temperature_readings[DAYS][HOURS];
    for (i = 0; i < DAYS; i++) {
        for (j = 0; j < HOURS; j++) {
            average_temperature += temperature_readings[i][j];
        }
    }
    average_temperature /= HOURS * DAYS;

}

/**
 * 为一个8*8的字符数组编写声明，数组名chess_board.然后用一个循环把下列数据写入数组(每个字符对应一个数组元素);
 */
void exec08_10() {
    char chess_board[8][8] = {{'r', 'n', 'b', 'q', 'k', 'b', 'n', 'r'},
                              {'p', 'p', 'p', 'p', 'p', 'p', 'p', 'p'},
                              {0,   '.', 0,   '.', 0,   '.', 0,   '.'},
                              {'.', 0,   '.', 0,   '.', 0,   '.'},
                              {0,   '.', 0,   '.', 0,   '.', 0,   '.'},
                              {'.', 0,   '.', 0,   '.', 0,   '.'},
                              {'P', 'P', 'P', 'P', 'P', 'P', 'P', 'P'},
                              {'R', 'N', 'B', 'Q', 'K', 'B', 'N', 'R'}};
}

/**
 * 为一个8*8的字符数组编写一个声明，数组名为checker_board.然后用一个循环把下列数据写入数组(每个字符对应一个数组元素):
 * 提示：如果i+j为偶数，则i行j列的元素为B
 */
void exec08_11() {
    char checker_board[8][8];
    int i, j;

    for (i = 0; i < 8; i++) {
        for (j = 0; j < 8; j++) {
            checker_board[i][j] = (i + j) % 2 == 0 ? 'B' : 'R';
        }
    }
}

//int main() {
//exec08_test01();
//  exec08_test05();
//    return 0;
//}